## Import Neccesary Libraries

In [37]:
import pandas as pd
import numpy as np

## Import Data

In [38]:
sales_data_2017 = pd.read_csv("Sales Transactions-2017.csv")
sales_data_2017.head()

,Date,Voucher,Party,Product,Qty,Rate,Gross,Disc,Voucher Amount
0,1/4/2017,Sal:1,SOLANKI PLASTICS,DONA-VAI-9100,2,"1,690.00","3,380.00",NaN,"13,100.00"
1,1/4/2017,Sal:1,SOLANKI PLASTICS,LITE FOAM(1200),6,"1,620.00","9,720.00",NaN,NaN
2,1/4/2017,Sal:2,SARNESWARA TRADERS,VISHNU CHOTA WINE,500,23,"11,500.00",NaN,"30,990.00"
3,1/4/2017,Sal:2,SARNESWARA TRADERS,LITE FOAM(1200),6,"1,620.00","9,720.00",NaN,NaN
4,1/4/2017,Sal:2,SARNESWARA TRADERS,DONA-VAI-9100,5,"1,690.00","8,450.00",NaN,NaN

In [39]:
sales_data_2018 = pd.read_csv("Sales Transactions-2018 (1).csv")
sales_data_2018.head()

,Date,Voucher,Party,Product,Qty,Rate,Gross,Disc,Voucher Amount
0,1/4/2018,Sal:146,TP13,SILVER POUCH 9*12,50,85,"4,250.00",NaN,"66,724.00"
1,1/4/2018,Sal:146,TP13,RUBBER,5,290,"1,450.00",NaN,NaN
2,1/4/2018,Sal:146,TP13,DURGA 10*12 Blue,"1,600.00",5.5,"8,800.00",NaN,NaN
3,1/4/2018,Sal:146,TP13,DURGA 13*16 BLUE,400,11,"4,400.00",NaN,NaN
4,1/4/2018,Sal:146,TP13,10*12 SARAS-NAT,600,8.1,"4,860.00",NaN,NaN

In [40]:
sales_data_2019 = pd.read_csv("Sales Transactions-2019 (1).csv")
sales_data_2019.head()

,Date,Voucher,Party,Product,Qty,Rate,Gross,Disc,Voucher Amount
0,1/4/2019,Sal:687,BALAJI PLASTICS,DONA-VAI-9100,1,"1,730.00","1,730.00",NaN,"3,460.00"
1,1/4/2019,Sal:687,BALAJI PLASTICS,SMART BOUL(48),1,"1,730.00","1,730.00",NaN,NaN
2,1/4/2019,Sal:688,BALAJI PLASTICS,Vishnu Ice,110,18.5,"2,035.00",NaN,"2,035.00"
3,,,28/3,,0,0,,,
4,1/4/2019,Sal:689,BALAJI PLASTICS,100LEAF -SP,3,585,"1,755.00",NaN,"1,755.00"

In [41]:
sales_data = pd.concat([sales_data_2017,sales_data_2018,sales_data_2019])
sales_data.head()

,Date,Voucher,Party,Product,Qty,Rate,Gross,Disc,Voucher Amount
0,1/4/2017,Sal:1,SOLANKI PLASTICS,DONA-VAI-9100,2,"1,690.00","3,380.00",NaN,"13,100.00"
1,1/4/2017,Sal:1,SOLANKI PLASTICS,LITE FOAM(1200),6,"1,620.00","9,720.00",NaN,NaN
2,1/4/2017,Sal:2,SARNESWARA TRADERS,VISHNU CHOTA WINE,500,23,"11,500.00",NaN,"30,990.00"
3,1/4/2017,Sal:2,SARNESWARA TRADERS,LITE FOAM(1200),6,"1,620.00","9,720.00",NaN,NaN
4,1/4/2017,Sal:2,SARNESWARA TRADERS,DONA-VAI-9100,5,"1,690.00","8,450.00",NaN,NaN

In [42]:
sales_data.shape

(111206, 9)

In [43]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 111206 entries, 0 to 19175
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Date            98615 non-null   object
 1   Voucher         98649 non-null   object
 2   Party           111166 non-null  object
 3   Product         98615 non-null   object
 4   Qty             98649 non-null   object
 5   Rate            98648 non-null   object
 6   Gross           98648 non-null   object
 7   Disc            5597 non-null    object
 8   Voucher Amount  27560 non-null   object
dtypes: object(9)
memory usage: 8.5+ MB

In [44]:
sales_data.isnull().sum()

Date               12591
Voucher            12557
Party                 40
Product            12591
Qty                12557
Rate               12558
Gross              12558
Disc              105609
Voucher Amount     83646
dtype: int64

In [45]:
sales_data.dtypes

Date              object
Voucher           object
Party             object
Product           object
Qty               object
Rate              object
Gross             object
Disc              object
Voucher Amount    object
dtype: object

In [46]:
sales_data.drop(columns=["Gross","Disc","Voucher Amount"],axis=1,inplace=True)

In [47]:
sales_data

,Date,Voucher,Party,Product,Qty,Rate
0,1/4/2017,Sal:1,SOLANKI PLASTICS,DONA-VAI-9100,2,"1,690.00"
1,1/4/2017,Sal:1,SOLANKI PLASTICS,LITE FOAM(1200),6,"1,620.00"
2,1/4/2017,Sal:2,SARNESWARA TRADERS,VISHNU CHOTA WINE,500,23
3,1/4/2017,Sal:2,SARNESWARA TRADERS,LITE FOAM(1200),6,"1,620.00"
4,1/4/2017,Sal:2,SARNESWARA TRADERS,DONA-VAI-9100,5,"1,690.00"
...,...,...,...,...,...,...
19171,10/10/2019,Sal:4935,K.SRIHARI,13*16 WHITE RK,400,16
19172,NaN,NaN,NaN,NaN,NaN,NaN
19173,NaN,NaN,NaN,NaN,NaN,NaN
19174,NaN,Total,NaN,NaN,"99,284.90","175,381.65"
19175,NaN,Total,NaN,NaN,"2,710,193.00","5,519,888.40"

In [48]:
sales_data["Voucher"].replace(to_replace="Sal:",value="",inplace=True,regex=True)
sales_data["Qty"].replace(to_replace=",",value="",inplace=True,regex=True)
sales_data["Rate"].replace(to_replace=",",value="",inplace=True,regex=True)

In [49]:
sales_data.head()

       Date Voucher               Party            Product  Qty     Rate
0  1/4/2017       1    SOLANKI PLASTICS      DONA-VAI-9100    2  1690.00
1  1/4/2017       1    SOLANKI PLASTICS    LITE FOAM(1200)    6  1620.00
2  1/4/2017       2  SARNESWARA TRADERS  VISHNU CHOTA WINE  500       23
3  1/4/2017       2  SARNESWARA TRADERS    LITE FOAM(1200)    6  1620.00
4  1/4/2017       2  SARNESWARA TRADERS      DONA-VAI-9100    5  1690.00

In [50]:
sales_data.dtypes

Date       object
Voucher    object
Party      object
Product    object
Qty        object
Rate       object
dtype: object

In [51]:
sales_data.isnull().sum()

Date       12591
Voucher    12557
Party         40
Product    12591
Qty        12557
Rate       12558
dtype: int64

In [52]:
sales_data["Date"] = pd.to_datetime(sales_data["Date"],errors="coerce")
sales_data["Voucher"] = pd.to_numeric(sales_data["Voucher"],errors="coerce")
sales_data["Qty"] = pd.to_numeric(sales_data["Qty"],errors="coerce")
sales_data["Rate"] = pd.to_numeric(sales_data["Rate"],errors="coerce")

In [53]:
sales_data.shape

(111206, 6)

In [54]:
sales_data.dropna(inplace=True)
sales_data.shape

(95561, 6)

In [55]:
sales_data.isnull().sum()

Date       0
Voucher    0
Party      0
Product    0
Qty        0
Rate       0
dtype: int64

In [56]:
sales_data["Voucher"]=sales_data["Voucher"].astype('float').astype('int')

In [57]:
sales_data["Qty"]=sales_data["Qty"].astype('float').astype('int')

In [58]:
sales_data.dtypes

Date       datetime64[ns]
Voucher             int32
Party              object
Product            object
Qty                 int32
Rate              float64
dtype: object

In [59]:
sales_data["Party"] = sales_data["Party"].apply(lambda x:x.upper())

In [60]:
sales_data["Product"] = sales_data["Product"].apply(lambda x:x.upper())

In [61]:
sales_data

,Date,Voucher,Party,Product,Qty,Rate
0,2017-01-04,1,SOLANKI PLASTICS,DONA-VAI-9100,2,1690.0
1,2017-01-04,1,SOLANKI PLASTICS,LITE FOAM(1200),6,1620.0
2,2017-01-04,2,SARNESWARA TRADERS,VISHNU CHOTA WINE,500,23.0
3,2017-01-04,2,SARNESWARA TRADERS,LITE FOAM(1200),6,1620.0
4,2017-01-04,2,SARNESWARA TRADERS,DONA-VAI-9100,5,1690.0
...,...,...,...,...,...,...
19167,2019-10-10,4935,K.SRIHARI,16*20(100-W),140,26.0
19168,2019-10-10,4935,K.SRIHARI,10*12 KRISHNA-BK(10,600,8.4
19169,2019-10-10,4935,K.SRIHARI,13*16 BK(100)KRISHN,320,16.0
19170,2019-10-10,4935,K.SRIHARI,10*12 RK,800,8.5
19171,2019-10-10,4935,K.SRIHARI,13*16 WHITE RK,400,16.0

In [62]:
sales_data.shape

(95561, 6)

In [63]:
sales_data.isnull().sum()

Date       0
Voucher    0
Party      0
Product    0
Qty        0
Rate       0
dtype: int64

In [64]:
sales_data.dtypes

Date       datetime64[ns]
Voucher             int32
Party              object
Product            object
Qty                 int32
Rate              float64
dtype: object